SeeedJP/seeed-wio-terminal-mbed6/TARGET_Atmel/utils/cmsis/TARGET_SAMD51A/include/component/gclk_instance.h
#ifndef _SAMD51_GCLK_INSTANCE_
#define _SAMD51_GCLK_INSTANCE_

/* GCLK PCHCTRL Register index */
#define GCLK_PCHCTRL_ID_0_GCLK_OSCCTRL_DFLL48      (0)
#define GCLK_PCHCTRL_ID_1_GCLK_OSCCTRL_FDPLL0      (1)
#define GCLK_PCHCTRL_ID_2_GCLK_OSCCTRL_FDPLL1      (2)
#define GCLK_PCHCTRL_ID_3_GCLK_OSCCTRL_FDPLL0_32K  (3)
#define GCLK_PCHCTRL_ID_3_GCLK_OSCCTRL_FDPLL1_32K  (3)
#define GCLK_PCHCTRL_ID_3_GCLK_SDHC0_SLOW          (3)
#define GCLK_PCHCTRL_ID_3_GCLK_SDHC1_SLOW          (3)
#define GCLK_PCHCTRL_ID_3_GCLK_SERCOM0_SLOW        (3)
#define GCLK_PCHCTRL_ID_3_GCLK_SERCOM1_SLOW        (3)
#define GCLK_PCHCTRL_ID_3_GCLK_SERCOM2_SLOW        (3)
#define GCLK_PCHCTRL_ID_3_GCLK_SERCOM3_SLOW        (3)
#define GCLK_PCHCTRL_ID_3_GCLK_SERCOM4_SLOW        (3)
#define GCLK_PCHCTRL_ID_3_GCLK_SERCOM5_SLOW        (3)
#define GCLK_PCHCTRL_ID_3_GCLK_SERCOM6_SLOW        (3)
#define GCLK_PCHCTRL_ID_3_GCLK_SERCOM7_SLOW        (3)
#define GCLK_PCHCTRL_ID_4_GCLK_EIC                 (4)
#define GCLK_PCHCTRL_ID_5_GCLK_FREQM_MSR           (5)
#define GCLK_PCHCTRL_ID_6_GCLK_FREQM_REF           (6)
#define GCLK_PCHCTRL_ID_7_GCLK_SERCOM0_CORE        (7)
#define GCLK_PCHCTRL_ID_8_GCLK_SERCOM1_CORE        (8)
#define GCLK_PCHCTRL_ID_9_GCLK_TC0                 (9)
#define GCLK_PCHCTRL_ID_9_GCLK_TC1                 (9)
#define GCLK_PCHCTRL_ID_10_GCLK_USB                (10)
#define GCLK_PCHCTRL_ID_11_GCLK_EVSYS0             (11)
#define GCLK_PCHCTRL_ID_12_GCLK_EVSYS1             (12)
#define GCLK_PCHCTRL_ID_13_GCLK_EVSYS2             (13)
#define GCLK_PCHCTRL_ID_14_GCLK_EVSYS3             (14)
#define GCLK_PCHCTRL_ID_15_GCLK_EVSYS4             (15)
#define GCLK_PCHCTRL_ID_16_GCLK_EVSYS5             (16)
#define GCLK_PCHCTRL_ID_17_GCLK_EVSYS6             (17)
#define GCLK_PCHCTRL_ID_18_GCLK_EVSYS7             (18)
#define GCLK_PCHCTRL_ID_19_GCLK_EVSYS8             (19)
#define GCLK_PCHCTRL_ID_20_GCLK_EVSYS9             (20)
#define GCLK_PCHCTRL_ID_21_GCLK_EVSYS10            (21)
#define GCLK_PCHCTRL_ID_22_GCLK_EVSYS11            (22)
#define GCLK_PCHCTRL_ID_23_GCLK_SERCOM2_CORE       (23)
#define GCLK_PCHCTRL_ID_24_GCLK_SERCOM3_CORE       (24)
#define GCLK_PCHCTRL_ID_25_GCLK_TCC0               (25)
#define GCLK_PCHCTRL_ID_25_GCLK_TCC1               (25)
#define GCLK_PCHCTRL_ID_26_GCLK_TC2                (26)
#define GCLK_PCHCTRL_ID_26_GCLK_TC3                (26)
#define GCLK_PCHCTRL_ID_27_GCLK_CAN0               (27)
#define GCLK_PCHCTRL_ID_28_GCLK_CAN1               (28)
#define GCLK_PCHCTRL_ID_29_GCLK_TCC2               (29)
#define GCLK_PCHCTRL_ID_29_GCLK_TCC3               (29)
#define GCLK_PCHCTRL_ID_30_GCLK_TC4                (30)
#define GCLK_PCHCTRL_ID_30_GCLK_TC5                (30)
#define GCLK_PCHCTRL_ID_31_GCLK_PDEC               (31)
#define GCLK_PCHCTRL_ID_32_GCLK_AC                 (32)
#define GCLK_PCHCTRL_ID_33_GCLK_CCL                (33)
#define GCLK_PCHCTRL_ID_34_GCLK_SERCOM4_CORE       (34)
#define GCLK_PCHCTRL_ID_35_GCLK_SERCOM5_CORE       (35)
#define GCLK_PCHCTRL_ID_36_GCLK_SERCOM6_CORE       (36)
#define GCLK_PCHCTRL_ID_37_GCLK_SERCOM7_CORE       (37)
#define GCLK_PCHCTRL_ID_38_GCLK_TCC4               (38)
#define GCLK_PCHCTRL_ID_39_GCLK_TC6                (39)
#define GCLK_PCHCTRL_ID_39_GCLK_TC7                (39)
#define GCLK_PCHCTRL_ID_40_GCLK_ADC0               (40)
#define GCLK_PCHCTRL_ID_41_GCLK_ADC1               (41)
#define GCLK_PCHCTRL_ID_42_GCLK_DAC                (42)
#define GCLK_PCHCTRL_ID_43_GCLK_I2S0               (43)
#define GCLK_PCHCTRL_ID_44_GCLK_I2S1               (44)
#define GCLK_PCHCTRL_ID_45_GCLK_SDHC0              (45)
#define GCLK_PCHCTRL_ID_46_GCLK_SDHC1              (46)
#define GCLK_PCHCTRL_ID_47_GCLK_CM4_TRACE          (47)
#endif
